app/controllers/post_images_controller.rb

	def create
		@post_image = PostImage.new(post_image_params)
		@post_image.user_id = current_user.id
		if @post_image.save
---
INSERT INTO "post_images" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", "2018-11-03 12:37:51.452408"], ["updated_at", "2018-11-03 12:37:51.452408"]]